#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # vault_generic_secret.grafana-sa-key-secret will be created
  + resource "vault_generic_secret" "grafana-sa-key-secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/integration/grafana-sa-integration.json"
    }

  # vault_generic_secret.jade-api-sa-key-secret will be created
  + resource "vault_generic_secret" "jade-api-sa-key-secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/integration/api-sa-integration-b64"
    }

  # vault_generic_secret.jade-db-login-secret will be created
  + resource "vault_generic_secret" "jade-db-login-secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/integration/helm-datarepodb-integration"
    }

  # vault_generic_secret.sql-backup-key-secret will be created
  + resource "vault_generic_secret" "sql-backup-key-secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/integration/sql-backup-integration-b64"
    }

  # vault_generic_secret.sql-sa-key-secret will be created
  + resource "vault_generic_secret" "sql-sa-key-secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/integration/sqlproxy-sa-integration-b64"
    }

  # module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        additional_zones            = []
        cluster_ipv4_cidr           = "10.127.0.0/20"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "35.239.144.49"
        id                          = "projects/broad-jade-integration/locations/us-central1/clusters/integration-master"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/broad-jade-integration/zones/us-central1-a/instanceGroups/gke-integration-mast-integration-node-86fa6072-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-jade-integration/zones/us-central1-b/instanceGroups/gke-integration-mast-integration-node-848b3763-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-jade-integration/zones/us-central1-c/instanceGroups/gke-integration-mast-integration-node-3d4d794b-grp",
        ]
        label_fingerprint           = "a9dc16a7"
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
        master_version              = "1.16.9-gke.6"
        min_master_version          = "1.15.9-gke.24"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "integration-master"
        network                     = "projects/broad-jade-integration/global/networks/integration-network"
        node_locations              = [
            "us-central1-a",
            "us-central1-b",
            "us-central1-c",
        ]
        node_version                = "1.16.8-gke.15"
        project                     = "broad-jade-integration"
        remove_default_node_pool    = true
        resource_labels             = {}
        services_ipv4_cidr          = "10.0.16.0/20"
        subnetwork                  = "projects/broad-jade-integration/regions/us-central1/subnetworks/integration-subnet"

        addons_config {

            istio_config {
                disabled = true
            }

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            autoscaling_profile = "BALANCED"
            enabled             = false
        }

        database_encryption {
            state = "DECRYPTED"
        }

        ip_allocation_policy {
            cluster_ipv4_cidr_block       = "10.127.0.0/20"
            cluster_secondary_range_name  = "pods"
            services_ipv4_cidr_block      = "10.0.16.0/20"
            services_secondary_range_name = "services"
        }

        master_auth {
            client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyakNDQWNLZ0F3SUJBZ0lRR0hnSTBxZzhJTzNHMUxReGcvRXYxVEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlReE5EVXdPREZrWWkweFpERTFMVFJtTlRZdE9EazNNeTB6TkRVeE4yUmpZVGcyWmpJdwpIaGNOTWpBd05ESTFNVFV5TmpJM1doY05NalV3TkRJME1UVXlOakkzV2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFEUGZXVWY2d2o5WmdJQkkvNWgKSllnMzJpekFQcEpRUklyY240V0VyV2xzQ1hVUlpuK082SkVqeERIOE1XOEFnT0dlOHJmTFRET25YSGxCc01neApNRGIwaVZueTlJWkQ0L0xMR2pSUGZsZXd1NGVWbk15V2hOY3FqcVRKcFNHVjVmZFNHMm1nZ3I3TmxGWjg1Mk1HCnR5WEVwMmltN2ZnL0ZNcHpYOGVHWkloRW04OVJyZUJFNzFZNlhsR2FhZiswL3NpNkVUc3dPQUVNSGhZb016UWcKQ0gvU2k4RzhBYUd5NXBNbURQaE1vc3pzZWxnSzg5NHg4dlRTZGZMdS9SejlqZHV6N2ExKzE2RXV0bDhqWDlCOApOSytZU2hMQlI1QkphV3FWZ3QrQ3VyWFMwS1h2b3MzWkdzWnBoRE15d0p6Vnl3a1pvdEpoaE90cEhrdFV4SlMwClltdlhBZ01CQUFHakVEQU9NQXdHQTFVZEV3RUIvd1FDTUFBd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFIYnYKWWMyWlA5eFlWaXhUQndUZ3BTcnpZdGE3OUUwS3BWQW8xU3F2Z3lpKzAzbnlSTmRNQTVaMTlRTnJ4U002UHBDbwpVZFpCTkEzWm9Yejl5R1g4bHZPWlVPQ3JZREU0OFdMeUNUUFpxWGREcHJ5K0lWM0lxeEJoV1pUN2hicEtaRGhCCkYzeGN0ZGdsVjVQTjE5N3lZOXJCVU0ybGZkYU95bTJKUGtyMkgrOXVEcEp4ZjVsVGRYcnM5dnRrWVFyY0IxcHAKWWk1NStUeWE4WWVSK0t1bG9OUlY2b3FvK2loNG1FMlRTTEcxVVNVUHdrd1lYNW1MWFRCc0djV0NJa0tIS1AzQwoydlViWmhWcmJ2NlZOYUdsUzNKenA4VnhqWWx6NjBXOVRIalpOR1VUcXUyTXFzeG5QOGY4R3N6Q1YzNjdWa1BLCkl0UEZvU0pxNFpaOEtKdXVsdVU9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            client_key             = (sensitive value)
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURERENDQWZTZ0F3SUJBZ0lSQUxsVUN6NVVyeW5NUllUYTlGeHJWOWN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01UUTFNRGd4WkdJdE1XUXhOUzAwWmpVMkxUZzVOek10TXpRMU1UZGtZMkU0Tm1ZeQpNQjRYRFRJd01EUXlOVEUwTWpZeU5sb1hEVEkxTURReU5ERTFNall5Tmxvd0x6RXRNQ3NHQTFVRUF4TWtNVFExCk1EZ3haR0l0TVdReE5TMDBaalUyTFRnNU56TXRNelExTVRka1kyRTRObVl5TUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBdXRMRTFEL3dIclVwYXlaWGpEZTRtaGdlb2prWE1JeWNPVEg3M2luMAoycnN3OU1pbVpjWXYvbS9YdFNvVk5UUHBFdXhSTG1pa2FtZmdBTlRDVllkMzJxM1JjN1dBbzdobEVKQm91aUJzCjFzU2tUczJhNVJ1T2c4QlA1STA5VXhpTlVoS2JoWkp4NkRKZkM1QkYzU0t3SWg1VHlOQ3loTVBQa01Zc1ZsY1EKcUhRWnZoMGRGdDUxRGRIUXhKajFVUnZLNHhudGNMMEhoUDdxalAzZEpCUTBQMEl0RmVNdHpldjRSVHZNeS9ERQplMEpNUUFQNVhLN1ZYaFZZOTJjUCt1dGljUVhTWTE0ZzliUWU1N3FIRFJ5VkVyeDU3c3M3dGdDSWpOcWh5WWpDCnFxWTRsWFRBQzRYanNmSzZIRXBISTgza0VJQ0xwRzdsSmViRk8rNFoyUVlGN1FJREFRQUJveU13SVRBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQQpzSnRUUGJWbnh1NjM0WmhETmlUOGVpeHB6d0dScVZoTHByZG42em94YktZVGFSd0p5R3kyMkY1WUFsd0tJVEZYCmxGQ21JaWlkcXd6cnA3a2U5Q01CRklLRjk0UHVXS3hHWVNzcksvMGkzZitjUU1YeE8zTExUY2hQam5EVFVWUG8KaWxvSHdNSzJyQTVUYUJvNENWMkVIYmduU3BtWGJtTXZPdDMyU1A4Z1JCaUczbkNLQ0RTWmN0L25PZitnRnMydwpVV3R0OG9JMEdLY09pRFNCand5dVNDbWFBWXBaQUp0VW8xTEV4aHNPT3k0S1V6aHRaUnR1WnpnT2FFbndIN2tyCnkwRDRWQ3J3NjZHTHhLOVVLc1I2SkJmbUVCOVBzQzZwVHVCTEkzeWZWTnlqQTZvNFBjd3c2cFduZG15WHg4a2UKemtKL0o2K1YwWnhrSWI2NTFNVFlNQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"

            client_certificate_config {
                issue_client_certificate = true
            }
        }

      ~ master_authorized_networks_config {
          - cidr_blocks {
              - cidr_block = "13.72.77.230/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "20.185.33.115/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "20.36.168.44/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "52.184.179.19/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "52.247.8.189/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "52.252.58.219/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.112.0/21" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.112.0/21"
            }
          - cidr_blocks {
              - cidr_block = "69.173.120.0/22" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.120.0/22"
            }
          - cidr_blocks {
              - cidr_block = "69.173.124.0/23" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.124.0/23"
            }
          - cidr_blocks {
              - cidr_block = "69.173.126.0/24" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.126.0/24"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.0/25" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.0/25"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.128/26" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.128/26"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.192/27" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.192/27"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.224/30" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.224/30"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.228/32" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.228/32"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.230/31" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.230/31"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.232/29" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.232/29"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.240/28" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.240/28"
            }
          - cidr_blocks {
              - cidr_block = "69.173.64.0/19" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.64.0/19"
            }
          - cidr_blocks {
              - cidr_block = "69.173.96.0/20" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.96.0/20"
            }
        }

        network_policy {
            enabled = true
        }

        node_config {
            disk_size_gb      = 50
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "environment" = "integration"
                "project"     = "jade"
            }
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = [
                "jade",
                "integration",
                "kubernetes",
            ]
            taint             = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

        node_pool {
            initial_node_count  = 1
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/zones/us-central1-a/instanceGroupManagers/gke-integration-mast-integration-node-86fa6072-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/zones/us-central1-b/instanceGroupManagers/gke-integration-mast-integration-node-848b3763-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/zones/us-central1-c/instanceGroupManagers/gke-integration-mast-integration-node-3d4d794b-grp",
            ]
            max_pods_per_node   = 110
            name                = "integration-node"
            node_count          = 1
            node_locations      = [
                "us-central1-a",
                "us-central1-b",
                "us-central1-c",
            ]
            version             = "1.16.8-gke.15"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 50
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {
                    "environment" = "integration"
                    "project"     = "jade"
                }
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints"         = "true"
                    "google-compute-enable-virtio-rng" = "false"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/compute",
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = [
                    "jade",
                    "integration",
                    "kubernetes",
                ]
                taint             = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }

                workload_metadata_config {
                    node_metadata = "GKE_METADATA_SERVER"
                }
            }

            upgrade_settings {
                max_surge       = 1
                max_unavailable = 0
            }
        }

        pod_security_policy_config {
            enabled = true
        }

        private_cluster_config {
            enable_private_endpoint = false
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.227.0.0/28"
            peering_name            = "gke-n1035e4415d5bed2d558-c801-8d4b-peer"
            private_endpoint        = "10.227.0.2"
            public_endpoint         = "35.239.144.49"
        }

        release_channel {
            channel = "REGULAR"
        }

        workload_identity_config {
            identity_namespace = "broad-jade-integration.svc.id.goog"
        }
    }

  # module.performance-log-sinks.google_bigquery_dataset.logs[0] will be created
  + resource "google_bigquery_dataset" "logs" {
      + creation_time               = (known after apply)
      + dataset_id                  = (known after apply)
      + default_table_expiration_ms = 2678400000
      + delete_contents_on_destroy  = false
      + description                 = "Audit logs for datarepo for jade"
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "env" = "jade"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + project                     = (known after apply)
      + self_link                   = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.performance-log-sinks.google_logging_project_sink.bigquery-log-sink[0] will be created
  + resource "google_logging_project_sink" "bigquery-log-sink" {
      + destination            = (known after apply)
      + filter                 = "resource.type=\"k8s_container\" \"PerformanceLogger\""
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.performance-log-sinks.google_project_iam_binding.bigquery-admin[0] will be created
  + resource "google_project_iam_binding" "bigquery-admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.admin"
    }

  # module.performance-log-sinks.google_project_iam_binding.bigquery-data[0] will be created
  + resource "google_project_iam_binding" "bigquery-data" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.performance-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be created
  + resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.configWriter"
    }

  # module.performance-log-sinks.random_id.id will be created
  + resource "random_id" "id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 11 to add, 1 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on integration.tf line 79, in resource "google_dns_managed_zone" "dns_zone":
  79:   count       = "${var.env == var.suffix ? "1" : "0"}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Quoted references are deprecated

  on .terraform/modules/dns-set/terraform-modules/external-dns/dns.tf line 6, in data "google_dns_managed_zone" "dns_zone":
   6:     provider     = "google.targetdns"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
